app/controllers/admin/users_controller.rb

	def update
		@user = User.find(params[:id])
      if @user.update(first_name: params[:first_name], last_name: params[:last_name], email: params[:email], is_admin: params[:is_admin])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "email" = $3, "is_admin" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["first_name", "Name_modif"], ["last_name", "last_name_modif"], ["email", "modif@yopmail.com"], ["is_admin", true], ["updated_at", "2019-11-26 14:42:18.699663"], ["id", 2]]