app/views/carts/show.html.erb

            <%@cart.each do |t|%>
              <p class="card-text">Title : <%=@item.find(t.item_id).title%></p>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]