app/controllers/carts_controller.rb

  def show
    # Méthode qui récupère le potin concerné et l'envoie à la view show (show.html.erb) pour affichage
    @cart = Cart.find(current_user.id)
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", 8]]

  def create
    # Méthode qui créé un potin à partir du contenu du formulaire de new.html.erb, soumis par l'utilisateur
    # pour info, le contenu de ce formulaire sera accessible dans le hash params (ton meilleur pote)
    # Une fois la création faite, on redirige généralement vers la méthode show (pour afficher le potin créé)

    CartItem.create(cart: @cart, item_id: params[:item_id])
---
INSERT INTO "carts" ("created_at", "updated_at", "item_id", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-11-26 11:16:32.829003"], ["updated_at", "2019-11-26 11:16:32.829003"], ["item_id", 13], ["user_id", 1]]