app/controllers/charges_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", 7]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", 4]]
INSERT INTO "orders" ("created_at", "updated_at", "user_id", "item_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-11-26 14:49:34.917088"], ["updated_at", "2019-11-26 14:49:34.917088"], ["user_id", 8], ["item_id", 1]]
---
  def create
  	  @carts = Cart.where(user_id: params[:user_id])
  	  @amount = 0
  	  @carts.each do |t|
  	  	@amount = Item.find(t.item_id).price
  	  end


	  customer = Stripe::Customer.create({
	    email: params[:stripeEmail],
	    source: params[:stripeToken],
	  })

	  charge = Stripe::Charge.create({
	    customer: customer.id,
<<<<<<< HEAD
	    amount: @amount.round * 100,
=======
	    amount: @amount.round*100,
>>>>>>> b68a947ef88109c6cfdb01812e40c03af7b6190e
	    description: 'Rails Stripe customer',
	    currency: 'eur',
	  })
	  if charge
	  	@carts.each do |t|
	  		Order.create(user_id: params[:user_id], item_id: t.item_id)