app/controllers/items_controller.rb

  def show
    @cart = Cart.all
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 103], ["LIMIT", 1]]